#include <stdio.h>

int main() {
    // กรณีที่ 1: ใช้ int
    int score1 = 90.5;  // จะเกิดการตัดทศนิยม
    printf("กรณีที่ 1 - int score: %d\n", score1);

    // กรณีที่ 2: ใช้ float
    float score2 = 90.5;
    printf("กรณีที่ 2 - float score: %.1f\n", score2);

    return 0;
}
/*---------------------------------------------------------
กรณีที่ 1 :ใช้ int จะเกิดการตัดทศนิยม ทำให้ค่า 90;5 กลายเป็น 90

กรณีที่2 :ใช้ float จะไม่เกิดการตัดทศนิยม ทำให้ค่า 90;5 ก็ยังคงที่

สรุปคือถ้าต้องการค่าที่ที่ทศนิยมหรือละเอียด ควรใช้ float
---------------------------------------------------------*/